chunyen627-afk/stm32h7s78-project/projects/album/app_src/album_main.c
static void screen_init(void)
{
    /* BSP 預設 ARGB8888（每像素 4 bytes），我們畫的是 16 位元，
     * 不指定 RGB565 的話會用錯的列距去讀，畫面會橫向重複。 */
    if (BSP_LCD_InitEx(0, LCD_ORIENTATION_LANDSCAPE, LCD_PIXEL_FORMAT_RGB565,
                       PHYS_W, PHYS_H) != BSP_ERROR_NONE) {
        Error_Handler();
    }

    for (uint32_t i = 0; i < (uint32_t)PHYS_W * PHYS_H; i++) {
        ((uint16_t *)FB0_ADDR)[i] = 0;
        ((uint16_t *)FB1_ADDR)[i] = 0;
    }

    BSP_LCD_SetLayerAddress(0, 0, FB0_ADDR);
    /* no-reload：位址只寫進 shadow register，等我們要求垂直消隱重載才生效。
     * 否則 SetLayerAddress 會在畫面掃描途中重寫整組暫存器而撕裂。 */
    BSP_LCD_Reload(0, BSP_LCD_RELOAD_NONE);
    BSP_LCD_DisplayOn(0);

    g_front = 0;
    gfx_set_framebuffer((uint16_t *)FB1_ADDR);
}

static void present(void)
{
    uint32_t drawn = g_front ? FB0_ADDR : FB1_ADDR;

    /* 只寫 CFBAR 一個暫存器：它是 shadow register，寫入不會立即生效，
     * 等垂直消隱重載時整批原子切換，中間沒有半完成狀態。 */
    LTDC_Layer1->CFBAR = drawn;
    LTDC->SRCR = LTDC_SRCR_VBR;
    for (uint32_t guard = 0; guard < 2000000u; guard++) {
        if ((LTDC->SRCR & LTDC_SRCR_VBR) == 0u) {
            break;
        }
    }

    g_front ^= 1u;
    gfx_set_framebuffer((uint16_t *)(g_front ? FB0_ADDR : FB1_ADDR));
}

/* 睡到下一個中斷才醒，用來取代輪詢迴圈裡的 HAL_Delay()。
 *
 * HAL_Delay() 是忙等 —— 核心全速空轉一直讀 uwTick，600MHz 的 M7 這樣燒電
 * 很不划算。相簿大部分時間都在等（每張顯示 2~5 秒、解碼只佔 1.5 秒），
 * 所以這裡是最值得省的地方。
 *
 * __WFI() 讓核心停住，直到有中斷才繼續。SysTick 每 1ms 一次，所以每毫秒
 * 醒一下、其餘時間都在睡，等待的精度不變但核心幾乎不耗電。
 *
 * 注意：中斷必須是開著的，否則會永遠睡下去。這裡是主迴圈，沒有關中斷的
 * 情況；如果哪天在臨界區裡呼叫就會卡死。 */
static void nap(uint32_t ms)
{
    /* 見 album_run() 裡的 HAL_DBGMCU_EnableDBGSleepMode()：沒開的話，
     * 核心一睡 SWD 就整個連不上（Unable to read device id from ROM table）。 */
    uint32_t t0 = HAL_GetTick();

    while ((HAL_GetTick() - t0) < ms) {
        __WFI();
    }
}

static void rnd_mix(uint32_t v);      /* 定義在下面的亂數區塊 */
static void watchdog_feed(void);      /* 定義在下面的記憶卡狀態區塊 */
static bool sd_present(void);
static void show_scan_progress(void);
static bool screen_poll(void);
static void show_message(const char *line1, const char *line2);
static void draw_name_clipped(int x, int y, const char *s, int limit,
                              uint16_t color);

/* 觸控座標換成直立座標。
 * gfx 把邏輯 (x,y) 映到實體 offset (GFX_W-1-x)*PHYS_W + y，
 * 也就是實體列 = GFX_W-1-x、實體行 = y，反過來就是下面這樣。 */
static bool read_touch(int *x, int *y)
{
    TS_State_t st;

    if (BSP_TS_GetState(0, &st) != BSP_ERROR_NONE || !st.TouchDetected) {
        return false;
    }
    *x = (int)GFX_W - 1 - (int)st.TouchY;
    *y = (int)st.TouchX;

    /* 每一次觸控都是一次熵注入。 */
    rnd_mix(HAL_GetTick() + ((uint32_t)*x << 16) + (uint32_t)*y);
    return true;
}

/* 等到手指真的放開。
 *
 * 電容觸控在放開的瞬間會彈跳，讀到「沒碰到」不代表真的離開了。要連續數次
 * 都讀不到才算數，否則殘留的事件會被下一段程式碼當成新的觸碰 —— 進入播放
 * 後第一張照片立刻被判定成「使用者要離開」就是這樣來的。 */
static void wait_release(void)
{
    uint32_t t0 = HAL_GetTick();
    int clean = 0;
    int x, y;

    while (clean < 4) {
        watchdog_feed();
        if (read_touch(&x, &y)) {
            clean = 0;
            if (HAL_GetTick() - t0 > 3000u) {
                break;                  /* 觸控卡住就不要一直等 */
            }
        } else {
            clean++;
        }
        nap(10);
    }
    nap(40);
}


static uint32_t rnd_state = 0x2545F491u;

/* 把外部熵混進種子。
 *
 * 原本只用「開機到掃描完的時間」當種子，但那段耗時相當固定（SD 初始化加上
 * 掃描固定數量的檔案），每次開機常常拿到同一個毫秒數 —— 同種子就是同一組
 * 順序，看起來就像沒有隨機。
 *
 * 使用者按下螢幕的時間點才是真正不可預測的：以毫秒計沒有人按得出重複，
 * 再加上 CPU 週期計數器（600MHz，同一毫秒內還有六十萬個刻度）與觸控座標，
 * 每一次觸碰都會讓後續的順序完全不同。 */
static void rnd_mix(uint32_t v)
{
    rnd_state ^= v * 2654435761u;
    rnd_state ^= DWT->CYCCNT;
    rnd_state = (rnd_state << 7) | (rnd_state >> 25);
    if (rnd_state == 0u) {
        rnd_state = 0x2545F491u;
    }
}

static uint32_t rnd(void)
{
    rnd_state ^= rnd_state << 13;
    rnd_state ^= rnd_state >> 17;
    rnd_state ^= rnd_state << 5;
    return rnd_state;
}

/* ------------------------------------------------------------------ */
/* 記憶卡狀態與看門狗                                                  */
/* ------------------------------------------------------------------ */

static IWDG_HandleTypeDef g_iwdg;
static bool g_wdt_on;

/* 獨立看門狗，用來兜住「卡片沒回應」這個沒辦法從程式裡跳出來的情況。
 *
 * BSP_SD_Init() 最終會走到 HAL 的 SD_InitCard()，裡面有
 *   while (sd_rca == 0U)
 * 這個迴圈沒有逾時保護。卡片若停在異常狀態不回應 CMD3，程式就永遠出不來，
 * 畫面停在「載入中」而且沒有任何提示 —— 使用者只會覺得機器壞了。
 *
 * 同一個執行緒沒辦法讓自己跳出無窮迴圈，只能靠硬體。逾時設 16 秒，正常
 * 操作（解一張照片約 0.5 秒、掃描一次約 1 秒）遠遠用不到。 */
static void watchdog_start(void)
{
    g_iwdg.Instance       = IWDG;
    g_iwdg.Init.Prescaler = IWDG_PRESCALER_256;   /* LSI 32kHz / 256 = 125Hz */
    g_iwdg.Init.Reload    = 2000u;                /* 2000 / 125 = 16 秒 */
    g_iwdg.Init.Window    = IWDG_WINDOW_DISABLE;
    if (HAL_IWDG_Init(&g_iwdg) == HAL_OK) {
        g_wdt_on = true;
    }
}

/* 所有可能久留的迴圈裡都要餵，否則會被誤判成當機而重置。 */
static void watchdog_feed(void)
{
    if (g_wdt_on) {
        (void)HAL_IWDG_Refresh(&g_iwdg);
    }

    /* 順便更新 VBUS。這裡只是讀一個暫存器（連續轉換模式一直在跑），
     * 而 watchdog_feed 本來就是全域最常被呼叫的地方 —— 不必另外找地方輪詢。
     * 目前只記錄數值，還沒有拿它做模式切換。 */
    (void)vbus_mv();
}

static bool sd_present(void)
{
    return BSP_SD_IsDetected(0) == SD_PRESENT;
}

/* ------------------------------------------------------------------ */
/* USER 按鈕：螢幕開關                                                 */
/* ------------------------------------------------------------------ */

/* 亮度分檔。人眼對亮度的感知接近對數，線性分檔（100/75/50/25）看起來
 * 差別很小 —— 25% 佔空比看起來大約還有一半亮。所以改成感知上等距的級距。 */
static void brightness_set(uint32_t pct);   /* 定義在下面，中斷會直接呼叫 */

static const uint8_t BRIGHT_STEP[] = { 100u, 50u, 20u, 6u, 0u };
#define BRIGHT_STEPS  (sizeof(BRIGHT_STEP) / sizeof(BRIGHT_STEP[0]))

static uint32_t         g_bright_idx;      /* 指向 BRIGHT_STEP */
static uint32_t         g_brightness = 100u;
static bool             g_screen_on  = true;

/* 觸控維持輪詢，不要用 BSP_TS_EnableIT()。
 *
 * 踩過的雷：啟用觸控中斷之後，ISR 只清了 EXTI 的旗標，沒有去讀 GT911 的
 * 狀態暫存器。控制器的資料沒被取走就不再回報新的觸碰，於是
 * BSP_TS_GetState() 之後永遠回傳「沒碰到」—— 症狀是觸控整個失效。
 *
 * 要正確使用中斷，回呼裡必須把資料讀走（等於還是要做一次 I2C 交易），
 * 省不到什麼。而且現在的控制是按鍵負責、觸控只在暫停時判滑動，輪詢完全
 * 夠用。 */



/* USER 鍵三段手勢，全部在中斷裡判斷：
 *
 *   短按 (<600ms)    切換背光亮度（立刻套用）
 *   長按 (>=600ms)   暫停 / 繼續播放
 *
 * 沒有「更長按」這一段：使用者反映很容易不小心按過頭，本來只想暫停卻跳回
 * 選單。回選單改由暫停中往下滑提供 —— 用時間長度區分三段操作，對手指來說
 * 太難拿捏。
 *
 * BSP 預設是 GPIO_MODE_IT_FALLING（下拉、按下為高），中斷只在放開時觸發，
 * 量不出按了多久。這裡改成雙邊緣，在中斷裡讀腳位判斷是按下還是放開：
 * 按下記時間、放開算長度再分派。
 *
 * 亮度直接在中斷裡套用（只寫 GPIO 與 LPTIM 暫存器，很快）；暫停與回選單
 * 要主迴圈配合，所以立旗標，並由 photo_show() 的中斷檢查即時放棄解碼 ——
 * 否則按下去要等解碼那 1.5 秒跑完才有反應。 */
#define PRESS_LONG_MS   600u

static volatile uint8_t  g_req_pause;
static volatile uint32_t g_press_t0;
static volatile uint8_t  g_pressing;

void EXTI13_IRQHandler(void)
{
    BSP_PB_IRQHandler(BUTTON_USER);
}

void BSP_PB_Callback(Button_TypeDef Button)
{
    uint32_t now = HAL_GetTick();
    uint32_t held;

    if (Button != BUTTON_USER) {
        return;
    }
    g_dbg_btn_edge++;

    if (HAL_GPIO_ReadPin(BUTTON_USER_GPIO_PORT, BUTTON_USER_PIN)
        == GPIO_PIN_SET) {
        if (!g_pressing) {
            g_pressing = 1u;
            g_press_t0 = now;
        }
        return;
    }

    if (!g_pressing) {
        return;                     /* 沒配對到的放開，忽略 */
    }
    g_pressing = 0u;

    held = now - g_press_t0;
    if (held < 30u) {
        return;                     /* 太短，是彈跳 */
    }
    if (held >= PRESS_LONG_MS) {
        g_dbg_btn_long++;
        g_req_pause = 1u;
    } else {
        g_dbg_btn_short++;
        g_bright_idx = (g_bright_idx + 1u) % BRIGHT_STEPS;
        brightness_set(BRIGHT_STEP[g_bright_idx]);
    }
}

