chunyen627-afk/stm32h7s78-project/projects/album/app_src/album_main.c
/* ------------------------------------------------------------------ */
/* 影片                                                                */
/* ------------------------------------------------------------------ */

#define MAX_VIDEOS      16U

/* 影片清單只掃根目錄。
 *
 * 影格包動輒上百 MB，放根目錄是自然的擺法；而遞迴掃描每個 .bin 都要開檔
 * 讀檔頭，深層目錄裡如果有一堆無關的 .bin 會拖很久。照片那邊需要遞迴是
 * 因為使用者的相簿本來就有目錄結構，影片沒有這個需求。 */
static video_info_t g_vids[MAX_VIDEOS];
static uint32_t     g_vid_count;
volatile uint32_t   g_dbg_autovideo;   /* SWD 可寫，見主迴圈 */
volatile uint32_t   g_dbg_autoplay;    /* SWD 可寫，直接開始放照片 */
volatile uint32_t   g_dbg_fakedirs;    /* SWD 可寫，測試資料夾清單捲動 */
volatile uint32_t   g_dbg_fakevids;    /* SWD 可寫，測試影片清單捲動 */
volatile uint32_t   g_dbg_favtest;     /* SWD 可寫，見 fav_selftest() */
volatile uint32_t   g_dbg_wrtest;      /* SWD 可寫，純寫入壓力測試 fav_stress() */
volatile uint32_t   g_dbg_cardreinit;  /* SWD 可寫，重新初始化卡片（換時脈用）*/

static bool ends_with_bin(const char *name)
{
    size_t n = strlen(name);

    if (n < 5u) {
        return false;
    }
    return (name[n - 4] == '.') &&
           (name[n - 3] == 'b' || name[n - 3] == 'B') &&
           (name[n - 2] == 'i' || name[n - 2] == 'I') &&
           (name[n - 1] == 'n' || name[n - 1] == 'N');
}

static void scan_videos(void)
{
    DIR     dir;
    FILINFO fno;

    g_vid_count = 0;
    if (f_opendir(&dir, "0:") != FR_OK) {
        return;
    }
    while (g_vid_count < MAX_VIDEOS) {
        if (f_readdir(&dir, &fno) != FR_OK || fno.fname[0] == 0) {
            break;
        }
        if ((fno.fattrib & AM_DIR) || !ends_with_bin(fno.fname)) {
            continue;
        }
        watchdog_feed();

        {
            video_info_t *v = &g_vids[g_vid_count];
            size_t        n = strlen(fno.fname);

            /* 名字太長就跳過，不要讓 snprintf 默默截斷 —— 截斷後的路徑會
             * 指到別的檔案或根本開不起來，症狀比「這部影片沒出現」難查得多。 */
            if ((n + 4u) > VIDEO_PATH_MAX || (n + 1u) > VIDEO_NAME_MAX) {
                continue;
            }
            /* 路徑要自己組："0:" 加斜線加檔名。 */
            memcpy(v->path, "0:/", 3u);
            memcpy(v->path + 3, fno.fname, n + 1u);
            /* video_probe 只讀 24 bytes 的檔頭，不是有效的影格包就跳過 ——
             * 卡上可能有各種無關的 .bin。 */
            if (!video_probe(v->path, v)) {
                continue;
            }
            /* 長度上面已經檢查過，memcpy 比 snprintf 直接（也不會讓
             * 編譯器因為推不出上界而一直警告可能截斷）。 */
            memcpy(v->name, fno.fname, n + 1u);
            g_vid_count++;
        }
    }
    (void)f_closedir(&dir);
}

/* ---- 播放中的疊加層 ---------------------------------------------- */

#define OV_MS        3000U     /* 觸碰後疊加層顯示多久 */
#define PB_X         40
#define PB_W         400
#define PB_Y         700
#define PB_H         14
#define PB_HIT       60        /* 進度條上下各留這麼多的觸控範圍 */
#define BACK_X       20
#define BACK_Y       36
#define BACK_W       120
#define BACK_H       56

static void draw_time(int x, int y, uint32_t secs, uint16_t col)
{
    gfx_number(x, y, secs / 60u, col);
    gfx_text(x + (secs / 60u >= 10u ? 24 : 12), y, ":", col);
    {
        uint32_t s = secs % 60u;
        int      tx = x + (secs / 60u >= 10u ? 34 : 22);

        if (s < 10u) {
            gfx_number(tx, y, 0, col);
            gfx_number(tx + 12, y, s, col);
        } else {
            gfx_number(tx, y, s, col);
        }
    }
}

/* 疊加層每格都要重畫 —— DMA2D 轉色會把整個 framebuffer 蓋掉。
 * 所以只在使用者剛碰過螢幕的幾秒內畫，平常不花這個成本。 */
static void draw_overlay(const video_info_t *v, uint32_t idx, bool paused)
{
    uint32_t done_w = (uint32_t)PB_W * idx / (v->count ? v->count : 1u);
    uint32_t fps100 = v->fps_x100 ? v->fps_x100 : 2400u;

    gfx_pill(BACK_X, BACK_Y, BACK_W, BACK_H, COL_PANEL);
    gfx_text_center(BACK_X + BACK_W / 2, BACK_Y + 16, "返回", COL_TEXT);

    if (paused) {
        gfx_pill(GFX_W - 140, BACK_Y, BACK_W, BACK_H, COL_PANEL);
        gfx_text_center(GFX_W - 140 + BACK_W / 2, BACK_Y + 16, "暫停", COL_ACCENT);
    }

    /* 進度條：底槽 + 已播進度 + 目前位置的把手。 */
    gfx_fill_rect(PB_X, PB_Y, PB_W, PB_H, COL_LINE);
    if (done_w) {
        gfx_fill_rect(PB_X, PB_Y, (int)done_w, PB_H, COL_ACCENT);
    }
    gfx_fill_rect(PB_X + (int)done_w - 3, PB_Y - 8, 6, PB_H + 16, COL_TEXT);

    draw_time(PB_X, PB_Y + 30, (uint32_t)((uint64_t)idx * 100u / fps100),
              COL_TEXT);
    draw_time(PB_X + PB_W - 60, PB_Y + 30,
              (uint32_t)((uint64_t)v->count * 100u / fps100), COL_DIM);
}

/* 播放一部影片，無限循環，直到使用者按返回或卡片被拔掉。 */
static void play_video(const video_info_t *v)
{
    uint32_t idx = 0, next_ms, acc = 0;
    uint32_t frame_us, frame_ms, frame_frac;
    uint32_t ov_until = 0;
    bool     paused = false;

    if (!video_open(v)) {
        show_message("影片開啟失敗", v->name);
        nap(1500);
        return;
    }

    /* 疊加層用直立座標畫，跟選單一致 —— 影格本身已經在 PC 上轉成
     * 「直立看正確」的方向，所以兩者的上下左右是同一套。 */
    gfx_set_orientation(false);

    frame_us   = 100000000u / (v->fps_x100 ? v->fps_x100 : 2400u);
    frame_ms   = frame_us / 1000u;
    frame_frac = frame_us % 1000u;
    next_ms    = HAL_GetTick();

    for (;;) {
        int  x, y;
        bool touched;

        watchdog_feed();
        if (!sd_present()) {
            break;
        }

        if (!paused) {
            uint8_t *back = (uint8_t *)(g_front ? FB0_ADDR : FB1_ADDR);

            if (video_decode(idx, back)) {
                if (HAL_GetTick() < ov_until) {
                    draw_overlay(v, idx, false);
                }
                present();
            }
            idx = (idx + 1u) % v->count;      /* 無限循環 */
        }

        touched = read_touch(&x, &y);
        if (touched) {
            if (HAL_GetTick() >= ov_until) {
                /* 第一次碰只叫出疊加層，不會誤觸到底下的按鈕。 */
                ov_until = HAL_GetTick() + OV_MS;
            } else if (x >= BACK_X && x < BACK_X + BACK_W &&
                       y >= BACK_Y && y < BACK_Y + BACK_H) {
                wait_release();
                break;
            } else if (y >= PB_Y - PB_HIT && y < PB_Y + PB_H + PB_HIT) {
                /* 拖曳 seek。位移表讓任何一格都能直接定址，成本跟播下一格
                 * 一模一樣 —— 這是打包成單一檔案順帶換到的好處。 */
                int px = x - PB_X;

