chunyen627-afk/stm32h7s78-project/projects/album/app_src/album_main.c
                if (px < 0) { px = 0; }
                if (px > PB_W) { px = PB_W; }
                idx = (uint32_t)((uint64_t)px * v->count / PB_W);
                if (idx >= v->count) { idx = v->count - 1u; }
                ov_until = HAL_GetTick() + OV_MS;
                next_ms  = HAL_GetTick();     /* 跳完重新對時 */
                acc      = 0;
            } else {
                paused   = !paused;
                ov_until = HAL_GetTick() + OV_MS;
                wait_release();
            }
        }

        if (paused) {
            /* 暫停時仍要重畫，否則疊加層倒數結束後畫面不會更新。 */
            uint8_t *back = (uint8_t *)(g_front ? FB0_ADDR : FB1_ADDR);

            if (video_decode(idx, back)) {
                if (HAL_GetTick() < ov_until) {
                    draw_overlay(v, idx, true);
                }
                present();
            }
            nap(60);
            next_ms = HAL_GetTick();
            continue;
        }

        /* 按素材的節奏放。小數毫秒累積到 1ms 就補一格，否則 24fps 的
         * 41.67ms 無論取 41 還是 42 都會慢慢漂掉。 */
        next_ms += frame_ms;
        acc     += frame_frac;
        if (acc >= 1000u) {
            acc -= 1000u;
            next_ms += 1u;
        }
        if ((int32_t)(next_ms - HAL_GetTick()) > 0) {
            while ((int32_t)(next_ms - HAL_GetTick()) > 0) { }
        } else {
            next_ms = HAL_GetTick();          /* 跟不上就重新對時 */
        }
    }

    /* **一定要走這裡。** DMA 解碼整合進相簿正式路徑曾經把週邊弄壞
     * （board-notes 16.6），video_close() 會做完整拆除並把解碼器還給照片。 */
    video_close();
}

/* 影片清單。沒有影片時不會走到這裡（選單上的按鈕會是暗的）。 */
#define VROW_Y0        140
#define VROW_H         64
/* 可見列數要夾制。原本是有幾部就畫幾部，第 10 部開始會壓到下方的「返回」鈕、
 * 第 11 部以後直接畫到畫面外 —— 而且沒有捲動，等於永遠選不到。 */
#define VROWS_VISIBLE  8
#define VBTN_BACK_Y    720
#define VBTN_BACK_H    62

static uint32_t g_vscroll;

static uint32_t max_vscroll(void)
{
    return (g_vid_count > VROWS_VISIBLE) ? (g_vid_count - VROWS_VISIBLE) : 0u;
}

static void draw_video_list(void)
{
    gfx_set_orientation(false);
    gfx_clear(COL_BG);
    gfx_text_center(GFX_W / 2, 60, "選擇影片", COL_TEXT);

    {
        uint32_t shown = g_vid_count - g_vscroll;

        if (shown > VROWS_VISIBLE) {
            shown = VROWS_VISIBLE;
        }
        for (uint32_t i = 0; i < shown; i++) {
            uint32_t idx = g_vscroll + i;
            int      y   = VROW_Y0 + (int)i * VROW_H;
            uint32_t fps100 = g_vids[idx].fps_x100 ? g_vids[idx].fps_x100
                                                   : 2400u;

            gfx_pill(20, y, GFX_W - 40, VROW_H - 10, COL_PANEL);
            draw_name_clipped(38, y + 18, g_vids[idx].name,
                              GFX_W - 150, COL_TEXT);
            draw_time(GFX_W - 100, y + 18,
                      (uint32_t)((uint64_t)g_vids[idx].count * 100u / fps100),
                      COL_DIM);
        }
        if (g_vid_count > VROWS_VISIBLE) {
            gfx_text_center(GFX_W / 2, VROW_Y0 + VROWS_VISIBLE * VROW_H + 4,
                            "上下滑動看更多", COL_DIM);
        }
    }
    gfx_pill(16, VBTN_BACK_Y, GFX_W - 32, VBTN_BACK_H, COL_PANEL);
    gfx_text_center(GFX_W / 2, VBTN_BACK_Y + 12, "返回", COL_TEXT);
}

static void video_list_screen(void)
{
    bool dirty = true;

    for (;;) {
        int x, y;

        if (dirty) {
            for (int i = 0; i < 2; i++) {     /* 兩塊都要畫 */
                draw_video_list();
                present();
            }
            dirty = false;
        }
        watchdog_feed();
        if (!sd_present()) {
            return;
        }
        if (!screen_poll()) {
            nap(30);
            continue;
        }
        if (!read_touch(&x, &y)) {
            nap(15);
            continue;
        }
        (void)x;
        if (y >= VBTN_BACK_Y && y < VBTN_BACK_Y + VBTN_BACK_H) {
            wait_release();
            return;
        }
        if (y >= VROW_Y0 && y < VROW_Y0 + VROWS_VISIBLE * VROW_H) {
            /* 跟資料夾清單同一套：上下拖曳捲動，單純點一下才是選片。 */
            uint32_t seen = HAL_GetTick();
            int      dy = 0, tx, ty;

            for (;;) {
                watchdog_feed();
                if (read_touch(&tx, &ty)) {
                    int d = ty - y;

                    if (((d < 0) ? -d : d) > ((dy < 0) ? -dy : dy)) {
                        dy = d;
                    }
                    seen = HAL_GetTick();
                } else if ((HAL_GetTick() - seen) > SWIPE_GAP_MS) {
                    break;
                }
                nap(10);
            }

            if (dy <= -SCROLL_MIN_DY || dy >= SCROLL_MIN_DY) {
                int32_t rows = (int32_t)(-dy / VROW_H);
                int32_t ns;

                if (rows == 0) {
                    rows = (dy < 0) ? 1 : -1;
                }
                ns = (int32_t)g_vscroll + rows;
                if (ns < 0) { ns = 0; }
                if (ns > (int32_t)max_vscroll()) { ns = (int32_t)max_vscroll(); }
                if ((uint32_t)ns != g_vscroll) {
                    g_vscroll = (uint32_t)ns;
                    dirty = true;
                }
                continue;
            }
            {
                uint32_t i = g_vscroll + (uint32_t)(y - VROW_Y0) / VROW_H;

                if (i < g_vid_count) {
                    play_video(&g_vids[i]);
                    dirty = true;
                    continue;
                }
            }
            continue;
        }
        wait_release();
    }
}

/* ------------------------------------------------------------------ */
/* 選擇畫面                                                            */
/* ------------------------------------------------------------------ */

#define ROW_Y0       120
#define ROW_H        58
/* 可見列數從 7 減成 6，騰出的 58px 給「方向」那一列。資料夾清單本來就
 * 可以上下滑，少一列的代價比擠不下設定小。 */
#define ROWS_VISIBLE 5
#define BTN_ALL_Y    440
#define BTN_ALL_H    48
#define OR_Y         506
#define OR_H         48
#define OR_X0        110
#define OR_W         100
#define OR_GAP       10
#define SEQ_Y        574
#define SEQ_H        48
#define IV_Y         642
#define IV_H         48
#define IV_X0        110
#define IV_W         74
#define IV_GAP       10
#define BTN_GO_Y     708
#define BTN_GO_H     62
/* 底下那一列是 1~3 顆按鈕，等寬平分 16..GFX_W-16：
 *
 *   0 = 開始播放（一定有）
 *   1 = 最愛（收藏數 > 0 才出現）
 *   2 = 影片（卡上有影格包才出現）
 *
 * 原本是寫死的兩組座標（BTN_GO_W / BTN_VID_X），加第三顆之後組合變成四種，
 * 改成算的比較不會漏掉某一種。 */
#define BOT_GAP      12

static int bottom_slots(void)
{
    return 1 + ((fav_count() > 0u) ? 1 : 0) + (g_vid_count ? 1 : 0);
}

