chunyen627-afk/stm32h7s78-project/projects/album/app_src/album_main.c
static int bottom_fav_idx(void)
{
    return (fav_count() > 0u) ? 1 : -1;
}

static int bottom_vid_idx(void)
{
    if (!g_vid_count)         { return -1; }
    return (fav_count() > 0u) ? 2 : 1;
}

static void bottom_rect(int idx, int *x, int *w)
{
    int n = bottom_slots();

    *w = ((int)GFX_W - 32 - BOT_GAP * (n - 1)) / n;
    *x = 16 + idx * (*w + BOT_GAP);
}

static const char *const ORIENT_NAME[PHOTO_ORIENT_COUNT] = {
    "直立", "橫向", "自動"
};

static uint32_t g_scroll;

static uint32_t max_scroll(void)
{
    return (g_top_count > ROWS_VISIBLE) ? (g_top_count - ROWS_VISIBLE) : 0u;
}

static void draw_checkbox(int x, int y, bool on)
{
    gfx_rect(x, y, 32, 32, on ? COL_ACCENT : COL_LINE);
    gfx_rect(x + 1, y + 1, 30, 30, on ? COL_ACCENT : COL_LINE);
    if (on) {
        gfx_fill_rect(x + 8, y + 8, 16, 16, COL_ACCENT);
    }
}

/* 名稱太長就從尾端截掉，避免壓到右邊的張數。 */
static void draw_name_clipped(int x, int y, const char *s, int limit,
                              uint16_t color)
{
    char buf[NAME_MAX];

    strncpy(buf, s, NAME_MAX - 1U);
    buf[NAME_MAX - 1U] = 0;

    while (gfx_text_width(buf) > limit) {
        size_t len = strlen(buf);
        if (len == 0U) {
            break;
        }
        /* 往前退到不是 UTF-8 接續位元組的位置，才不會砍出半個字。 */
        do {
            len--;
        } while (len > 0U && ((buf[len] & 0xC0) == 0x80));
        buf[len] = 0;
    }
    gfx_text(x, y, buf, color);
}

static void draw_select_screen(void)
{
    uint32_t shown;

    /* 選單、掃描進度、錯誤訊息都是照直立版面寫死的座標。播放中可能切到
     * 橫向，回到這些畫面之前一定要扳回來，否則版面整個跑掉。 */
    gfx_set_orientation(false);
    gfx_clear(COL_BG);
    gfx_text_center(GFX_W / 2, 24, "電子相簿", COL_TEXT);
    gfx_text_center(GFX_W / 2, 62, "選擇要播放的資料夾", COL_DIM);

    shown = g_top_count - g_scroll;
    if (shown > ROWS_VISIBLE) {
        shown = ROWS_VISIBLE;
    }

    for (uint32_t i = 0; i < shown; i++) {
        uint32_t idx = g_scroll + i;
        int y = ROW_Y0 + (int)i * ROW_H;

        gfx_fill_rect(16, y, GFX_W - 32, ROW_H - 8, COL_PANEL);
        draw_checkbox(28, y + 9, g_top[idx].selected);
        draw_name_clipped(76, y + 15, g_top[idx].name,
                          GFX_W - 76 - 96, COL_TEXT);
        gfx_number_right(GFX_W - 28, y + 15, g_top[idx].photos, COL_DIM);
    }

    if (g_top_count > ROWS_VISIBLE) {
        gfx_text_center(GFX_W / 2, ROW_Y0 + ROWS_VISIBLE * ROW_H + 6,
                        "上下滑動看更多", COL_DIM);
    }

    gfx_pill(16, BTN_ALL_Y, GFX_W - 32, BTN_ALL_H, COL_PANEL);
    gfx_text_center(GFX_W / 2, BTN_ALL_Y + 14, "全部選取或取消", COL_TEXT);

    gfx_text(20, OR_Y + 14, "方向", COL_DIM);
    for (uint32_t o = 0; o < PHOTO_ORIENT_COUNT; o++) {
        int  x  = OR_X0 + (int)o * (OR_W + OR_GAP);
        bool on = ((uint32_t)photo_get_orientation() == o);
        gfx_pill(x, OR_Y, OR_W, OR_H, on ? COL_ACCENT : COL_PANEL);
        gfx_text_center(x + OR_W / 2, OR_Y + 14, ORIENT_NAME[o],
                        on ? COL_BG : COL_TEXT);
    }

    gfx_text(20, SEQ_Y + 14, "順序", COL_DIM);
    for (uint32_t k = 0; k < 2u; k++) {
        int  x  = OR_X0 + (int)k * (OR_W + OR_GAP);
        bool on = (g_shuffle == (k == 0u));

        gfx_pill(x, SEQ_Y, OR_W, SEQ_H, on ? COL_ACCENT : COL_PANEL);
        gfx_text_center(x + OR_W / 2, SEQ_Y + 14, SEQ_NAME[k],
                        on ? COL_BG : COL_TEXT);
    }

    gfx_text(20, IV_Y + 14, "間隔", COL_DIM);
    for (uint32_t s = 2; s <= 5; s++) {
        int  x  = IV_X0 + (int)(s - 2) * (IV_W + IV_GAP);
        bool on = (g_interval_s == s);
        gfx_pill(x, IV_Y, IV_W, IV_H, on ? COL_ACCENT : COL_PANEL);
        gfx_number(x + 20, IV_Y + 14, s, on ? COL_BG : COL_TEXT);
        gfx_text(x + 40, IV_Y + 14, "秒", on ? COL_BG : COL_TEXT);
    }

    {
        uint32_t n = selected_photo_count();
        int      x, w;

        bottom_rect(0, &x, &w);
        gfx_pill(x, BTN_GO_Y, w, BTN_GO_H, n ? COL_ACCENT : COL_PANEL);
        if (n) {
            gfx_text_center(x + w / 2, BTN_GO_Y + 12, "開始播放", COL_BG);
            if (bottom_slots() == 1) {      /* 只有一顆時才擠得下張數 */
                gfx_number_right(GFX_W - 40, BTN_GO_Y + 12, n, COL_BG);
            }
        } else {
            gfx_text_center(x + w / 2, BTN_GO_Y + 20,
                            (bottom_slots() > 1) ? "無照片"
                                                 : "沒有選取任何資料夾",
                            COL_DIM);
        }

        /* 收藏數是 0 就不畫這顆 —— 沒有內容的入口只會讓人按了失望。 */
        if (bottom_fav_idx() >= 0) {
            bottom_rect(bottom_fav_idx(), &x, &w);
            gfx_pill(x, BTN_GO_Y, w, BTN_GO_H, COL_PANEL);
            gfx_text_center(x + w / 2, BTN_GO_Y + 12, "最愛", COL_HEART);
        }
        if (bottom_vid_idx() >= 0) {
            bottom_rect(bottom_vid_idx(), &x, &w);
            gfx_pill(x, BTN_GO_Y, w, BTN_GO_H, COL_PANEL);
            gfx_text_center(x + w / 2, BTN_GO_Y + 12, "影片", COL_ACCENT);
        }
    }
}

/* 兩塊 buffer 都要畫，否則交換之後會看到上一次的內容。 */
static void repaint_select(void)
{
    for (int i = 0; i < 2; i++) {
        draw_select_screen();
        present();
    }
}

/* 回傳 true 表示要開始播放。 */
static bool select_screen(void)
{
    bool dirty = true;

    for (;;) {
        int x, y;

        if (dirty) {
            repaint_select();
            dirty = false;
        }

        watchdog_feed();
        if (!sd_present()) {
            return false;               /* 卡片被拔掉，交回上層處理 */
        }
        /* 除錯旗標也要在這裡看：選單這個迴圈在等觸控時不會回到主迴圈，
         * 只在主迴圈檢查的話，SWD 設旗標永遠不會生效。 */
        if (g_dbg_favtest || g_dbg_wrtest || g_dbg_cardreinit) {
            return false;               /* 交回主迴圈去跑測試 */
        }
        if (g_dbg_autovideo && g_vid_count > 0u) {
            play_video(&g_vids[0]);
            dirty = true;
            continue;
        }
        /* 除錯：直接開始放照片，讓遠端也追得動暫停/繼續的流程。 */
        if (g_dbg_autoplay && selected_photo_count() > 0u) {
            build_order();
            return true;
        }
        if (!screen_poll()) {
            /* 螢幕關著時不吃觸控，否則會在看不見的情況下改到設定。 */
            nap(30);
            continue;
        }

