chunyen627-afk/stm32h7s78-project/projects/album/app_src/album_main.c
        if (!read_touch(&x, &y)) {
            nap(15);
            continue;
        }

        if (y >= ROW_Y0 && y < ROW_Y0 + ROWS_VISIBLE * ROW_H) {
            /* 上下拖曳捲動、單純點一下才是勾選。
             *
             * 這個捲動先前**根本沒做** —— g_scroll 只有被讀、從來沒被寫過，
             * 所以第六個以後的資料夾看不到也選不到，而畫面上還寫著
             * 「上下滑動看更多」。用位移量分辨拖曳與點選，兩者不會互搶。 */
            uint32_t seen = HAL_GetTick();
            int      dy = 0, tx, ty;

            for (;;) {
                watchdog_feed();
                if (read_touch(&tx, &ty)) {
                    int d = ty - y;

                    if (((d < 0) ? -d : d) > ((dy < 0) ? -dy : dy)) {
                        dy = d;
                    }
                    seen = HAL_GetTick();
                } else if ((HAL_GetTick() - seen) > SWIPE_GAP_MS) {
                    break;
                }
                nap(10);
            }

            if (dy <= -SCROLL_MIN_DY || dy >= SCROLL_MIN_DY) {
                /* 往上拉（dy < 0）= 往清單後面看。不足一列也要動一列，
                 * 否則短拉會完全沒反應，使用者會以為壞掉。 */
                int32_t rows = (int32_t)(-dy / ROW_H);
                int32_t ns;

                if (rows == 0) {
                    rows = (dy < 0) ? 1 : -1;
                }
                ns = (int32_t)g_scroll + rows;
                if (ns < 0) { ns = 0; }
                if (ns > (int32_t)max_scroll()) { ns = (int32_t)max_scroll(); }
                if ((uint32_t)ns != g_scroll) {
                    g_scroll = (uint32_t)ns;
                    dirty = true;
                }
            } else {
                uint32_t i = g_scroll + (uint32_t)(y - ROW_Y0) / ROW_H;

                if (i < g_top_count) {
                    g_top[i].selected = !g_top[i].selected;
                    dirty = true;
                }
            }
        } else if (y >= BTN_ALL_Y && y < BTN_ALL_Y + BTN_ALL_H) {
            bool any = false;
            for (uint32_t i = 0; i < g_top_count; i++) {
                if (g_top[i].selected) {
                    any = true;
                }
            }
            for (uint32_t i = 0; i < g_top_count; i++) {
                g_top[i].selected = !any;
            }
            dirty = true;
        } else if (y >= OR_Y && y < OR_Y + OR_H) {
            for (uint32_t o = 0; o < PHOTO_ORIENT_COUNT; o++) {
                int bx = OR_X0 + (int)o * (OR_W + OR_GAP);
                if (x >= bx && x < bx + OR_W) {
                    photo_set_orientation((photo_orient_t)o);
                    dirty = true;
                }
            }
        } else if (y >= SEQ_Y && y < SEQ_Y + SEQ_H) {
            for (uint32_t k = 0; k < 2u; k++) {
                int bx = OR_X0 + (int)k * (OR_W + OR_GAP);

                if (x >= bx && x < bx + OR_W) {
                    g_shuffle = (k == 0u);
                    dirty = true;
                }
            }
        } else if (y >= IV_Y && y < IV_Y + IV_H) {
            for (uint32_t s = 2; s <= 5; s++) {
                int bx = IV_X0 + (int)(s - 2) * (IV_W + IV_GAP);
                if (x >= bx && x < bx + IV_W) {
                    g_interval_s = s;
                    dirty = true;
                }
            }
        } else if (y >= BTN_GO_Y && y < BTN_GO_Y + BTN_GO_H) {
            int bx, bw;

            if (bottom_vid_idx() >= 0) {
                bottom_rect(bottom_vid_idx(), &bx, &bw);
                if (x >= bx && x < bx + bw) {
                    wait_release();
                    video_list_screen();
                    dirty = true;
                    continue;
                }
            }
            if (bottom_fav_idx() >= 0) {
                bottom_rect(bottom_fav_idx(), &bx, &bw);
                if (x >= bx && x < bx + bw) {
                    g_fav_mode = true;
                    build_order();
                    if (g_order_count > 0u) {
                        wait_release();
                        return true;
                    }
                    /* 清單裡的照片一張都對不上：換過卡，或檔案被搬走了。 */
                    g_fav_mode = false;
                    show_message("最愛的照片都不在卡上",
                                 "可能換過卡或移動過檔案");
                    nap(2000);
                    dirty = true;
                    wait_release();
                    continue;
                }
            }
            bottom_rect(0, &bx, &bw);
            if (x >= bx && x < bx + bw && selected_photo_count() > 0U) {
                g_fav_mode = false;
                build_order();
                wait_release();
                return true;
            }
        }

        wait_release();
    }
}

/* ------------------------------------------------------------------ */
/* 播放                                                                */
/* ------------------------------------------------------------------ */

/* 掃描進度。數字會一直跳，讓使用者知道它在動而不是當掉了。 */
static void show_scan_progress(void)
{
    watchdog_feed();
    gfx_set_orientation(false);
    for (int i = 0; i < 2; i++) {
        gfx_clear(COL_BG);
        gfx_text_center(GFX_W / 2, GFX_H / 2 - 60, "掃描記憶卡", COL_TEXT);
        gfx_number_right(GFX_W / 2 + 20, GFX_H / 2, g_photo_count, COL_ACCENT);
        gfx_text(GFX_W / 2 + 28, GFX_H / 2, "張", COL_DIM);
        present();
    }
}

static void show_message(const char *line1, const char *line2)
{
    gfx_set_orientation(false);
    for (int i = 0; i < 2; i++) {
        gfx_clear(COL_BG);
        gfx_text_center(GFX_W / 2, GFX_H / 2 - 40, line1, COL_TEXT);
        if (line2) {
            gfx_text_center(GFX_W / 2, GFX_H / 2 + 10, line2, COL_DIM);
        }
        present();
    }
}

/* 螢幕關著時停在這裡。回傳 false 代表卡片被拔掉。 */
static bool wait_screen_on(void)
{
    while (!screen_poll()) {
        watchdog_feed();
        if (!sd_present()) {
            return false;
        }
        nap(100);
    }
    return true;
}

/* 判斷觸控是短按還是長按。回傳 0=沒碰到，1=短按，2=長按。
 *
 * 短按暫停／繼續、長按回選單。原本短按就直接離開，結果想停下來看某一張時
 * 只能被踢回選單，反而看不到。 */


/* 暫停 / 繼續的視覺回饋。
 *
 * 按鍵操作沒有觸覺以外的回饋，使用者按下去看畫面沒變會不確定有沒有成功。
 * 在畫面中央閃一個圖示一秒再還原 —— 蓋住的區域先備份，還原後照片完整。 */
#define ICON_SZ     140
#define ICON_SAVE   ((uint16_t *)0x91F00000u)   /* 140x140x2 = 39KB */

/* 圖示置中的位置。畫布尺寸隨方向改變，所以不能是常數。 */
static int icon_x(void) { return (gfx_width()  - ICON_SZ) / 2; }
static int icon_y(void) { return (gfx_height() - ICON_SZ) / 2; }

