chunyen627-afk/stm32h7s78-project/projects/album/app_src/album_main.c
static void ctl_backup(bool restore)
{
    uint16_t *sv = CTL_SAVE;

    sv = strip_backup(OV_TOP_Y, OV_TOP_H, sv, restore);
    (void)strip_backup(OV_BOT_Y, OV_BOT_H, sv, restore);
}

/* 只重畫下方的拉桿。拖曳時每十毫秒就要更新一次，不能整個疊加層重畫。 */
static void ov_draw_bar(uint32_t idx)
{
    uint16_t *back   = gfx_framebuffer();
    uint16_t *front  = (uint16_t *)(g_front ? FB1_ADDR : FB0_ADDR);
    bool      was_ls = gfx_is_landscape();
    uint32_t  total  = g_order_count ? g_order_count : 1u;
    uint32_t  done_w = (uint32_t)PB_W * idx / total;

    gfx_set_orientation(false);
    gfx_set_framebuffer(front);

    gfx_fill_rect(0, OV_BOT_Y, (int)GFX_W, OV_BOT_H, COL_BG);
    gfx_fill_rect(PB_X, PB_Y, PB_W, PB_H, COL_LINE);
    if (done_w != 0u) {
        gfx_fill_rect(PB_X, PB_Y, (int)done_w, PB_H, COL_ACCENT);
    }
    gfx_fill_rect(PB_X + (int)done_w - 3, PB_Y - 8, 6, PB_H + 16, COL_TEXT);

    gfx_number(PB_X, PB_Y + 30, idx + 1u, COL_TEXT);
    gfx_number_right(PB_X + PB_W, PB_Y + 30, total, COL_DIM);

    gfx_set_framebuffer(back);
    gfx_set_orientation(was_ls);
}

/* 愛心。字型裡沒有這個符號，而且用畫的才能同時表達實心／空心／不可按，
 * 所以直接用原語組：兩個圓當上緣，一個倒三角當下緣。
 *
 * 空心是「先畫大的、再用底色畫小一號的」挖出來的，不必另外寫外框演算法。 */
static void draw_heart(int cx, int cy, int r, uint16_t color)
{
    int i, span = r + r / 3;

    gfx_disc(cx - r / 2, cy - r / 3, r / 2, color);
    gfx_disc(cx + r / 2, cy - r / 3, r / 2, color);
    for (i = 0; i < span; i++) {
        int half = r - (i * r) / span;

        if (half > 0) {
            gfx_fill_rect(cx - half, cy - r / 3 + i, half * 2, 1, color);
        }
    }
}

/* 畫愛心那一格。ctl_draw() 與收藏狀態改變之後都會呼叫。
 *
 * 只重畫這一顆藥丸，範圍完全落在 ctl_backup() 存過的上排橫帶裡，
 * 所以 ov_hide() 照樣還原得乾淨 —— 不會多出一條沒被備份的區域。 */
static void ctl_draw_fav(void)
{
    uint16_t fg = (g_ov_fav == FAVBTN_LOCKED) ? COL_LINE : COL_HEART;
    int      cx = OV_FAV_X + OV_PILL_W / 2;
    int      cy = OV_TOP_Y + OV_TOP_H / 2;

    gfx_pill(OV_FAV_X, OV_TOP_Y, OV_PILL_W, OV_TOP_H, COL_PANEL);
    draw_heart(cx, cy, 15, fg);
    if (g_ov_fav != FAVBTN_ON) {
        /* 挖空：小一號的底色愛心蓋上去就剩下外框。 */
        draw_heart(cx, cy, 10, COL_PANEL);
    }
}

static void ctl_draw(void)
{
    uint16_t *back   = gfx_framebuffer();
    uint16_t *front  = (uint16_t *)(g_front ? FB1_ADDR : FB0_ADDR);
    bool      was_ls = gfx_is_landscape();

    gfx_set_orientation(false);
    gfx_set_framebuffer(front);

    gfx_pill(OV_BACK_X, OV_TOP_Y, OV_PILL_W, OV_TOP_H, COL_PANEL);
    gfx_text_center(OV_BACK_X + OV_PILL_W / 2, OV_TOP_Y + 16, "返回", COL_TEXT);

    ctl_draw_fav();

    /* 方向那顆直接顯示目前模式（自動／直立／橫向），按下去之前就知道狀態。 */
    gfx_pill(OV_ORIENT_X, OV_TOP_Y, OV_PILL_W, OV_TOP_H, COL_PANEL);
    gfx_text_center(OV_ORIENT_X + OV_PILL_W / 2, OV_TOP_Y + 16,
                    ORIENT_NAME[photo_get_orientation()], COL_TEXT);

    gfx_pill(OV_PAUSE_X, OV_TOP_Y, OV_PILL_W, OV_TOP_H, COL_PANEL);
    gfx_text_center(OV_PAUSE_X + OV_PILL_W / 2, OV_TOP_Y + 16,
                    "暫停", COL_ACCENT);

    gfx_set_framebuffer(back);
    gfx_set_orientation(was_ls);

    ov_draw_bar(g_ov_index);
}

/* 收藏狀態改變之後只重畫愛心那一顆，不整個疊加層重畫（跟 ov_draw_bar
 * 同一個模式）。範圍在已備份的上排橫帶內，還原不受影響。 */
static void ov_refresh_fav(void)
{
    uint16_t *back   = gfx_framebuffer();
    uint16_t *front  = (uint16_t *)(g_front ? FB1_ADDR : FB0_ADDR);
    bool      was_ls = gfx_is_landscape();

    gfx_set_orientation(false);
    gfx_set_framebuffer(front);
    ctl_draw_fav();
    gfx_set_framebuffer(back);
    gfx_set_orientation(was_ls);
}

/* 在拉桿那條橫帶上顯示一行字（成功／失敗的回饋）。 */
static void ov_draw_note(const char *msg, uint16_t color)
{
    uint16_t *back   = gfx_framebuffer();
    uint16_t *front  = (uint16_t *)(g_front ? FB1_ADDR : FB0_ADDR);
    bool      was_ls = gfx_is_landscape();

    gfx_set_orientation(false);
    gfx_set_framebuffer(front);

    /* 座標必須落在 OV_BOT_Y..+OV_BOT_H（684..780）這條**已備份**的橫帶裡，
     * 否則 ov_hide() 擦不掉，字就永久烙在那塊 buffer 上（board-notes 18.6）。 */
    gfx_fill_rect(0, OV_BOT_Y, (int)GFX_W, OV_BOT_H, COL_BG);
    gfx_text_center((int)GFX_W / 2, PB_Y + 20, msg, color);

    gfx_set_framebuffer(back);
    gfx_set_orientation(was_ls);
}

/* 目前顯示的那張照片的完整路徑。沒有有效照片時回傳 NULL。 */
static const char *cur_photo_path(void)
{
    if (g_order_count == 0u || g_ov_index >= g_order_count) {
        return NULL;
    }
    return PLAYLIST_BASE + g_order[g_ov_index] * PATH_MAX;
}

/* 切換收藏。
 *
 * 清單版只寫一格（一個磁區），幾毫秒就回來，所以不需要進度條 ——
 * 第一版是複製整張照片才需要。失敗訊息仍然畫在 ctl_backup() 存過的
 * 橫帶裡，ov_hide() 才還原得乾淨（board-notes 18.6）。 */
static void fav_toggle_current(void)
{
    const char  *p = cur_photo_path();
    bool         was_on;
    fav_result_t r;

    if (p == NULL || g_ov_fav == FAVBTN_LOCKED) {
        return;
    }
    was_on = (g_ov_fav == FAVBTN_ON);
    r      = was_on ? fav_remove(p) : fav_add(p);

    if (r == FAV_OK) {
        g_ov_fav = was_on ? FAVBTN_OFF : FAVBTN_ON;
    } else if (r == FAV_ERR_FULL) {
        ov_draw_note("最愛已滿（上限 256 張）", COL_HEART);
        nap(1800);
    } else {
        ov_draw_note(was_on ? "移出最愛失敗" : "加入最愛失敗", COL_HEART);
        nap(1500);
    }

    ov_refresh_fav();
    ov_draw_bar(g_ov_index);        /* 把訊息蓋回張數顯示 */
}

/* 回傳動作代碼；-1 = 疊加層以外（＝繼續播放）。
 * 「暫停」那顆只是指示，點它跟點空白處一樣。 */
static int ctl_hit(int x, int y)
{
    if (y >= OV_TOP_Y && y < OV_TOP_Y + OV_TOP_H) {
        if (x >= OV_BACK_X && x < OV_BACK_X + OV_PILL_W) {
            return PAUSE_MENU;
        }
        if (x >= OV_ORIENT_X && x < OV_ORIENT_X + OV_PILL_W) {
            return PAUSE_ROTATE;
        }
        /* 不可按的時候當成沒點到，讓它落到「整片畫面」那條去 —— 使用者
         * 會看到繼續播放而不是一顆沒反應的按鈕。 */
        if (g_ov_fav != FAVBTN_LOCKED &&
            x >= OV_FAV_X && x < OV_FAV_X + OV_PILL_W) {
            return PAUSE_FAV;
        }
    }
    if (y >= PB_Y - PB_HIT && y < PB_Y + PB_H + PB_HIT) {
        return PAUSE_SEEK;
    }
    return -1;
}

/* 疊加層目前有沒有蓋上去。存還原必須成對，所以集中在這兩個函式裡
 * （board-notes 14.5 那個對稱性教訓）。 */
static bool g_ov_shown;

static void ov_show(void)
{
    if (!g_ov_shown) {
        ctl_backup(false);
        ctl_draw();
        g_ov_shown = true;
    }
}

static void ov_hide(void)
{
    if (g_ov_shown) {
        ctl_backup(true);
        g_ov_shown = false;
    }
}

/* 量一次拖曳：等到手指離開，回傳整段過程中的**最大水平位移**。
 *
 * 取最大位移而不是放開瞬間的位置，而且容忍中途漏報 —— 快速滑動時觸控
 * 控制器會掉幾筆座標，一讀不到就結束的話位移只算到中斷點為止
 * （board-notes 14.7）。
 *
 * 順帶：它回來時手指一定已經離開，所以呼叫端不必再 wait_release()。 */
static int measure_drag(int x0)
{
    uint32_t seen = HAL_GetTick();
    int      dx = 0, x, y;

