chunyen627-afk/stm32h7s78-project/projects/album/app_src/album_main.c
    for (;;) {
        watchdog_feed();
        if (read_touch(&x, &y)) {
            int d = x - x0;

            if (((d < 0) ? -d : d) > ((dx < 0) ? -dx : dx)) {
                dx = d;
            }
            seen = HAL_GetTick();
        } else if ((HAL_GetTick() - seen) > SWIPE_GAP_MS) {
            break;                      /* 真的放開了 */
        }
        nap(10);
    }
    return dx;
}

static int paused_loop_inner(void);

/* 只有「剛進暫停」才閃那顆圖示（目前已經不閃了，保留旗標備用）。 */
static bool g_pause_flash;

/* 除錯：SWD 寫入 PAUSE_* 就當成按了那一顆。觸控沒辦法遠端重現，
 * 沒有這個鉤子就只能靠使用者回報。不寫（維持 -1）等於不存在。 */
volatile int32_t  g_dbg_inject = -1;
volatile uint32_t g_dbg_pause_entries;
volatile int32_t  g_dbg_last_action;
volatile int32_t  g_dbg_tx, g_dbg_ty, g_dbg_hit;

/* 所有出口都會經過這裡，不會有「某條路徑忘了還原」的問題。 */
static int paused_loop(void)
{
    int a;

    g_ov_shown = false;
    ov_show();
    a = paused_loop_inner();
    ov_hide();
    return a;
}


static int paused_loop_inner(void)
{
    g_paused    = 1u;
    g_req_pause = 0u;               /* 消化掉進來的那一次 */
    /* 不再閃暫停圖示。控制列跳出來本身就是最清楚的回饋，而那個圖示要停
     * 幾百毫秒，等於每次進暫停都先卡一下。 */
    g_pause_flash = false;
    /* 把上一個動作殘留的觸碰吃掉。放在**進來的時候**而不是「按下去之後」——
     * 按鈕要按下就有反應，不能等手指離開才動作。 */
    wait_release();

    g_dbg_pause_entries++;
    {
    uint32_t ov_until = HAL_GetTick() + OV_MS;

    for (;;) {
        int x0, y0;

        watchdog_feed();
        /* 疊加層過了時間就自己收起來，但**維持暫停** —— 跟影片一樣，
         * 收起來只是讓照片看得完整，不代表繼續播。 */
        if (g_ov_shown && (int32_t)(HAL_GetTick() - ov_until) >= 0) {
            ov_hide();
        }
        if (g_dbg_inject >= 0) {
            int hit = g_dbg_inject;

            g_dbg_inject = -1;
            /* 收藏要走跟觸控**同一條**路：就地做完、留在暫停。
             * 直接 return 的話會掉到下面翻頁的預設值去（dir 算出 +1），
             * 症狀是「注入 6 卻換了一張照片」。
             *
             * 疊加層可能已經自己收起來了，而進度條畫在它備份過的橫帶上，
             * 所以先確保它蓋著（ov_show 本身是冪等的）。 */
            if (hit == PAUSE_FAV) {
                ov_show();
                fav_toggle_current();
                ov_until          = HAL_GetTick() + OV_MS;
                g_dbg_last_action = hit;
                continue;
            }
            if (hit != PAUSE_ROTATE) {
                g_paused = 0u;
            }
            g_dbg_last_action = hit;
            return hit;
        }
        if (!sd_present()) {
            g_req_pause = 0u;
            g_paused    = 0u;
            return PAUSE_MENU;
        }
        if (g_req_pause) {
            g_req_pause = 0u;
            g_paused    = 0u;
            flash_icon(false);
            return PAUSE_RESUME;
        }

        if (read_touch(&x0, &y0)) {
            int hit;

            /* 疊加層收起來之後，點一下就是繼續播放。
             *
             * 原本是「先把疊加層叫回來」（照影片那套），但暫停中的疊加層
             * 三秒就收起，使用者等一下再點就一定要點兩下才播得起來 ——
             * 回報的「要慢點兩下」正是這個。點一下切換播放/暫停優先。 */
            if (!g_ov_shown) {
                int dx = measure_drag(x0);

                g_paused = 0u;
                if (dx <= -SEEK_MIN_DX) {
                    g_dbg_last_action = PAUSE_PREV;
                    return PAUSE_PREV;
                }
                if (dx >= SEEK_MIN_DX) {
                    g_dbg_last_action = PAUSE_NEXT;
                    return PAUSE_NEXT;
                }
                g_dbg_last_action = PAUSE_RESUME;
                return PAUSE_RESUME;
            }
            ov_until = HAL_GetTick() + OV_MS;   /* 有互動就延長 */
            hit = ctl_hit(x0, y0);

            g_dbg_touch_hit++;
            g_dbg_tx  = x0;
            g_dbg_ty  = y0;
            g_dbg_hit = hit;

            if (hit == PAUSE_SEEK) {
                /* 拖曳定位。手指還在畫面上時只更新把手與張數（很便宜），
                 * 放開才真的去解那一張 —— 每張要 1.5 秒，邊拖邊解會卡死。
                 *
                 * 一個像素約等於十張（4254 張攤在 400px 上），所以這是
                 * 粗調；要精準前後一張請用整片畫面的左右拉。 */
                uint32_t total = g_order_count ? g_order_count : 1u;
                uint32_t tgt   = g_ov_index;
                uint32_t seen  = HAL_GetTick();
                int      lastx = x0, x, y, px;

                for (;;) {
                    watchdog_feed();
                    if (read_touch(&x, &y)) {
                        lastx = x;
                        seen  = HAL_GetTick();
                    } else if ((HAL_GetTick() - seen) > SWIPE_GAP_MS) {
                        break;              /* 真的放開了 */
                    }
                    px = lastx - PB_X;
                    if (px < 0)    { px = 0; }
                    if (px > PB_W) { px = PB_W; }
                    tgt = (uint32_t)(((uint64_t)px * total) / PB_W);
                    if (tgt >= total) { tgt = total - 1u; }
                    if (tgt != g_ov_index) {
                        g_ov_index = tgt;
                        ov_draw_bar(tgt);
                    }
                    nap(10);
                }
                g_seek_target     = tgt;
                g_dbg_last_action = PAUSE_SEEK;
                return PAUSE_SEEK;
            }

            /* 收藏就地處理，不離開這個迴圈 —— 疊加層必須維持蓋著，
             * 進度條才畫得進已備份的橫帶（board-notes 18.6）。
             * 而且使用者當場就看到愛心變實心，不必等重畫。 */
            if (hit == PAUSE_FAV) {
                fav_toggle_current();
                ov_until = HAL_GetTick() + OV_MS;
                /* 手指還在螢幕上的話，下一圈會把同一次觸碰再算一次 ——
                 * 症狀是「按一下卻收藏又取消」（board-notes 18.1 那個
                 * 一次觸碰被吃兩次的家族）。 */
                wait_release();
                continue;
            }

            if (hit >= 0) {
                /* 按下就回報，不等手指離開。切方向要留在暫停，
                 * 讓使用者當場看到結果。 */
                if (hit != PAUSE_ROTATE) {
                    g_paused = 0u;
                }
                g_dbg_last_action = hit;
                return hit;
            }

            /* 控制以外的整片畫面：拖曳＝翻頁（翻書那種感覺），
             * 單純點一下＝繼續播放。
             *
             * measure_drag() 回來時手指一定已經離開，所以「繼續」這條也
             * 順便滿足了「要等手指離開才回報」—— 不然恢復播放之後，
             * 播放迴圈的「點畫面暫停」會把同一次觸碰再吃一次，
             * 症狀就是「點一下播放不了」。 */
            {
                int dx = measure_drag(x0);

                g_paused = 0u;
                if (dx <= -SEEK_MIN_DX) {
                    g_dbg_last_action = PAUSE_PREV;
                    return PAUSE_PREV;
                }
                if (dx >= SEEK_MIN_DX) {
                    g_dbg_last_action = PAUSE_NEXT;
                    return PAUSE_NEXT;
                }
                g_dbg_last_action = PAUSE_RESUME;
                return PAUSE_RESUME;
            }
        }
        nap(8);
    }
    }
}


/* 等目前這張照片的展示時間走完。
 *
 * already_ms 是「這張已經在螢幕上待了多久」—— 也就是解下一張花掉的時間。
 * 解碼期間前一張本來就在螢幕上，那段時間當然要算進展示時間裡，否則使用者
 * 設 2 秒會變成「解碼 1.5 秒 + 等 2 秒 = 3.5 秒」，設定值和實際對不上。
 *
 * 回傳 0 = 正常等完，1 = 要離開播放，2 = 卡片被拔掉，
 *     3 = 暫停中按了上一張，4 = 下一張。 */
static int wait_interval(uint32_t already_ms)
{
    uint32_t wait_ms = g_interval_s * 1000u;
    uint32_t waited  = (already_ms > wait_ms) ? wait_ms : already_ms;
    uint32_t last    = HAL_GetTick();

    while (waited < wait_ms) {
        uint32_t now;

        watchdog_feed();
        if (!sd_present()) {
            return 2;
        }
        if (!screen_poll()) {
            /* 亮度 0（螢幕關著）：不累計時間，再點亮時這張還有完整時間。 */
            nap(100);
            last = HAL_GetTick();
            continue;
        }

        now = HAL_GetTick();
        waited += now - last;
        last = now;

        if (g_req_pause) {
            return 3;               /* 交給 slideshow 統一處理暫停 */
        }

        /* 播放中點一下畫面就暫停並叫出控制列。
         *
         * 原本只有實體鍵能暫停，而滑動手勢只在暫停中才有作用 —— 等於
         * 「要先知道有那顆按鍵，才進得去操作介面」。點畫面是最直覺的入口，
         * 而且跟影片播放器的操作方式一致。 */
        {
            int tx, ty;

