chunyen627-afk/stm32h7s78-project/projects/album/app_src/album_main.c
            if ((HAL_GetTick() - g_resume_ms) > RESUME_GUARD_MS &&
                read_touch(&tx, &ty)) {
                (void)tx; (void)ty;
                /* 不在這裡等放開 —— paused_loop_inner 進來就會吃掉殘留的
                 * 觸碰。在這裡等等於讓「點一下叫出控制列」多花兩百毫秒。 */
                return 3;
            }
        }
        nap(15);
    }
    return 0;
}

/* 暫停期間的互動，含翻頁。
 *
 * 翻頁之後要「留在暫停」，所以這裡是個迴圈：paused_loop() 回報翻頁就解碼
 * 並顯示，然後再進 paused_loop() 等下一個指令，直到使用者要繼續或回選單。
 *
 * 先前這段邏輯散在 wait_interval 和 slideshow 兩處，而 wait_interval 只判斷
 * 「是不是回選單」，翻頁的回傳值被當成沒事發生 —— 症狀就是滑動翻了頁卻
 * 立刻自動繼續播放。集中在一個地方就不會再漏。
 *
 * *cur 進來是目前顯示的索引，出去是最後顯示的那張。
 * 回傳 0 = 繼續播放，1 = 回選單。 */
static int pause_session(int32_t *cur)
{
    g_pause_flash = true;
    for (;;) {
        int a;

        /* 疊加層的拉桿要顯示目前是第幾張。 */
        g_ov_index = (uint32_t)((*cur < 0) ? 0 : *cur);

        /* 愛心的狀態要在畫疊加層之前算好。清單在記憶體裡，純查表不碰卡片。 */
        {
            const char *p = cur_photo_path();

            if (p == NULL || !fav_ready()) {
                g_ov_fav = FAVBTN_LOCKED;
            } else {
                g_ov_fav = fav_is(p) ? FAVBTN_ON : FAVBTN_OFF;
            }
        }

        a = paused_loop();
        int dir;
        uint32_t target, tries;
        photo_result_t r;

        if (a == PAUSE_MENU) {
            return 1;
        }
        if (a == PAUSE_RESUME) {
            g_resume_ms = HAL_GetTick();
            return 0;
        }
        if (a == PAUSE_SEEK) {
            /* 放開才解那一張。停在暫停，讓使用者可以接著再拖或翻頁。 */
            uint32_t t = g_seek_target;

            if (t < g_order_count &&
                photo_show(PLAYLIST_BASE + g_order[t] * PATH_MAX)
                    == PHOTO_OK) {
                present();
                *cur = (int32_t)t;
                note_decode(true);
            }
            continue;
        }

        if (a == PAUSE_ROTATE) {
            /* 自動 <-> 固定，不再三段循環。離開自動時凍結在**目前這張的
             * 方向** —— 使用者看到什麼就固定什麼，畫面不會按一下就翻掉。 */
            if (photo_get_orientation() == PHOTO_ORIENT_AUTO) {
                photo_set_orientation(gfx_is_landscape()
                                      ? PHOTO_ORIENT_LANDSCAPE
                                      : PHOTO_ORIENT_PORTRAIT);
            } else {
                photo_set_orientation(PHOTO_ORIENT_AUTO);
            }
            /* 重畫目前這張，讓使用者當場看到新方向的結果。 */
            if (*cur >= 0 &&
                photo_show(PLAYLIST_BASE + g_order[*cur] * PATH_MAX)
                    == PHOTO_OK) {
                present();
            }
            flash_orient();
            continue;
        }

        /* 翻頁：往指定方向找一張解得開的，最多繞一圈。 */
        dir    = (a == PAUSE_PREV) ? -1 : 1;
        target = (uint32_t)((*cur < 0) ? 0 : *cur);
        tries  = 0;
        r      = PHOTO_ERR_READ;

        while (tries < g_order_count && !g_card_sick) {
            watchdog_feed();
            target = (target + g_order_count + (uint32_t)dir) % g_order_count;
            r = photo_show(PLAYLIST_BASE + g_order[target] * PATH_MAX);
            tries++;
            if (r == PHOTO_OK || r == PHOTO_ABORTED) {
                break;
            }
            note_decode(false);
        }
        if (r == PHOTO_OK) {
            present();
            *cur = (int32_t)target;
            note_decode(true);
        }
    }
}

/* 播放。
 *
 * 解碼與顯示重疊：目前這張在螢幕上的時候，就先把下一張解進另一塊 buffer，
 * 時間到直接切換。這樣換頁是瞬間的，而且間隔設定值就是實際的展示時間 ——
 * 只要解碼比間隔快。解碼比間隔慢的話，展示時間就等於解碼時間，沒辦法更快。 */
static void slideshow(void)
{
    uint32_t pos = 0;           /* 下一張要解碼的 g_order 索引 */
    int32_t  cur = -1;          /* 顯示中的索引，-1 = 還沒顯示過 */

    wait_release();

    for (;;) {
        photo_result_t r;
        uint32_t t0;

        watchdog_feed();
        if (!sd_present() || g_card_sick || !wait_screen_on()) {
            return;
        }

        /* 解下一張：畫進 back buffer，此時前一張還在螢幕上。 */
        t0 = HAL_GetTick();
        r = photo_show(PLAYLIST_BASE + g_order[pos] * PATH_MAX);
        if (r != PHOTO_OK && r != PHOTO_ABORTED) {
            r = photo_show(PLAYLIST_BASE + g_order[pos] * PATH_MAX);
        }
        g_last_ms = HAL_GetTick() - t0;

        if (r == PHOTO_ABORTED) {
            /* 解碼途中按了暫停：這張不要了，停在螢幕上那張。
             * 半畫好的 back buffer 沒有 present，看不到。 */
            if (pause_session(&cur)) {
                return;
            }
            pos = (uint32_t)((cur < 0) ? 0 : (cur + 1)) % g_order_count;
            continue;
        }

        if (r == PHOTO_OK) {
            note_decode(true);

            if (cur >= 0) {
                int w = wait_interval(g_last_ms);

                if (w == 1 || w == 2) {
                    return;             /* 回選單或卡片被拔掉 */
                }
                if (w == 3) {
                    if (pause_session(&cur)) {
                        return;
                    }
                    /* 暫停期間可能翻過頁，接著要播的是目前這張的下一張。
                     * back buffer 裡預解的那張作廢，重新解。 */
                    pos = (uint32_t)(cur + 1) % g_order_count;
                    continue;
                }
            }
            present();
            cur = (int32_t)pos;
        } else {
            /* 一張壞掉的照片不能讓相框停住，記錄之後直接換下一張。 */
            note_decode(false);
        }

        pos++;
        if (pos >= g_order_count) {
            build_order();              /* 播完一輪重新洗牌 */
            pos = 0;
        }
    }
}

/* ------------------------------------------------------------------ */

/* 卡片還插著但停止回應時的復原。
 *
 * 軟體重置**不會**切斷 SD 卡電源，所以光是重開機救不回來（README 記過
 * 這條）。要靠 BSP_SD_DeInit() 把 SDMMC 斷電、偵測腳 DeInit 掉，
 * 下一次 disk_initialize 才會從乾淨的狀態重跑完整的 BSP_SD_Init。
 *
 * 這是「卡片不回應」與「卡片被拔掉」共用的復原路徑 —— 差別只在前者
 * 使用者不必動手。 */
static void card_recover(void)
{
    g_dbg_card_recover++;
    show_message("記憶卡沒有回應", "重新初始化中");

    f_mount(NULL, g_drive, 0);          /* 丟掉 FatFs 的快取 */
    (void)BSP_SD_DeInit(0);
    for (int i = 0; i < 10; i++) {      /* 分段等，中間要餵狗 */
        watchdog_feed();
        HAL_Delay(100);
    }

    g_read_fail_run = 0;
    g_card_sick     = false;            /* 外層迴圈會重新掛載並掃描 */
}

/* 掛載並掃描一次。回傳 false 代表這輪不能播（沒卡、掛不起來、沒照片）。 */
static bool mount_and_scan(void)
{
    g_top_count   = 0;
    g_photo_count = 0;
    g_order_count = 0;
    memset(g_top, 0, sizeof(g_top));

    g_stage = 31;
    g_err = (int32_t)f_mount(&g_fs, g_drive, 1);
    g_stage = 32;
    if (g_err != FR_OK) {
        show_message("記憶卡無法讀取", "請確認格式為 FAT32");
        return false;
    }

    /* 掛好了才能讀清單檔。放在掃描之前，這樣選單畫出來就知道有幾張最愛。 */
    fav_init(g_drive);

