chunyen627-afk/stm32h7s78-project/projects/album/app_src/album_main.c
    g_stage = 4;
    strncpy(g_scan_path, g_drive, SCAN_PATH_LEN - 1U);
    g_scan_path[SCAN_PATH_LEN - 1U] = 0;
    {
        /* f_opendir 吃 "0:" 這種形式，結尾不要斜線。 */
        size_t n = strlen(g_scan_path);
        while (n > 0U && g_scan_path[n - 1U] == '/') {
            g_scan_path[--n] = 0;
        }
    }
    g_cur_top = MAX_TOP;
    scan(0);
    watchdog_feed();

    /* 測試捲動用：假裝有這麼多資料夾。**只存在記憶體**，不會動到卡片，
     * 重開機就沒了。不寫（維持 0）就完全等於不存在。 */
    if (g_dbg_fakedirs > g_top_count && g_dbg_fakedirs <= MAX_TOP) {
        for (uint32_t i = g_top_count; i < g_dbg_fakedirs; i++) {
            (void)snprintf(g_top[i].name, NAME_MAX, "測試資料夾 %u",
                           (unsigned)(i + 1u));
            g_top[i].photos   = 0;
            g_top[i].selected = false;
        }
        g_top_count = g_dbg_fakedirs;
    }

    /* 影片只掃根目錄，很快。放在照片掃描之後，這樣選單畫出來時就知道
     * 要不要顯示「影片」按鈕。 */
    scan_videos();

    /* 測試影片清單捲動用。跟 g_dbg_fakedirs 一樣**只存在記憶體**，
     * 假的那幾部 count = 0，點下去 video_open() 會被檔頭檢查擋掉。 */
    if (g_dbg_fakevids > g_vid_count && g_dbg_fakevids <= MAX_VIDEOS) {
        for (uint32_t i = g_vid_count; i < g_dbg_fakevids; i++) {
            (void)snprintf(g_vids[i].name, VIDEO_NAME_MAX, "測試影片 %u",
                           (unsigned)(i + 1u));
            g_vids[i].path[0]  = 0;
            g_vids[i].count    = 0;
            g_vids[i].fps_x100 = 2400u;
        }
        g_vid_count = g_dbg_fakevids;
    }
    watchdog_feed();

    /* 只有影片沒有照片也算可用 —— 使用者可能就是拿它當影片播放器。 */
    if (g_photo_count == 0U && g_vid_count == 0U) {
        show_message("卡片裡沒有找到照片", "支援 jpg 與 jpeg");
        return false;
    }
    return true;
}

/* 卡片被拔掉之後的處理：卸載檔案系統，等使用者插回來。
 *
 * 一定要 f_mount(NULL) 卸載。FatFs 會把 FAT 表與目錄資訊快取在記憶體裡，
 * 換了一張卡還沿用舊快取，讀到的會是不存在的位置。 */
static void wait_for_card(void)
{
    f_mount(NULL, g_drive, 0);

    show_message("請插入記憶卡", "插入後會自動重新掃描");
    while (!sd_present()) {
        watchdog_feed();
        nap(100);
    }

    /* 插入的瞬間接點會彈跳，等它穩定再動卡片，否則初始化容易失敗。 */
    for (int i = 0; i < 10; i++) {
        watchdog_feed();
        nap(100);
    }
    show_message("讀取記憶卡", "載入中");
}

/* ------------------------------------------------------------------ */
/* 最愛的自動測試                                                      */
/* ------------------------------------------------------------------ */

/* SWD 寫 g_dbg_favtest = N 就跑一輪：挑 N 張平均散布的照片收藏，
 * 再用最愛模式把它們全部播一遍。不寫就完全等於不存在
 * （board-notes 16.3：實驗要由外部旗標觸發）。
 *
 * 為什麼要做成韌體端的自動測試而不是用 SWD 一步一步戳：
 * 每次 SWD 連線要一秒多，戳十幾步就好幾十秒，而且**節奏跟使用者用手點
 * 完全不同** —— 這次的失敗正是連續操作幾次之後才出現的，
 * 慢慢戳反而重現不了。 */
volatile uint32_t g_dbg_ft_step;        /* 正在收藏第幾張 */
volatile uint32_t g_dbg_ft_added;       /* 收藏成功幾張 */
volatile int32_t  g_dbg_ft_err;         /* 第一次失敗的錯誤碼 */
volatile uint32_t g_dbg_ft_failat;      /* 第幾張開始失敗 */
volatile uint32_t g_dbg_ft_order;       /* 最愛模式建出幾張的播放順序 */
volatile uint32_t g_dbg_ft_shown;       /* 播成功幾張 */
volatile uint32_t g_dbg_ft_showfail;
volatile uint32_t g_dbg_ft_wr;          /* 整輪用掉幾次 disk_write */
volatile uint32_t g_dbg_ft_done;        /* 1 = 跑完 */

extern volatile uint32_t g_sd_writes;

static void fav_selftest(uint32_t n)
{
    uint32_t step, w0;

    if (n == 0u || g_photo_count == 0u) {
        return;
    }
    if (n > g_photo_count) { n = g_photo_count; }
    step = g_photo_count / n;
    if (step == 0u) { step = 1u; }

    g_dbg_ft_done = 0; g_dbg_ft_step = 0; g_dbg_ft_added = 0;
    g_dbg_ft_err  = 0; g_dbg_ft_failat = 0; g_dbg_ft_order = 0;
    g_dbg_ft_shown = 0; g_dbg_ft_showfail = 0;
    w0 = g_sd_writes;

    show_message("最愛自動測試", "收藏中");

    for (uint32_t i = 0; i < n && !g_card_sick; i++) {
        const char  *path = PLAYLIST_BASE + (i * step) * PATH_MAX;
        fav_result_t r;

        g_dbg_ft_step = i + 1u;
        watchdog_feed();
        r = fav_add(path);
        if (r == FAV_OK) {
            g_dbg_ft_added++;
        } else if (g_dbg_ft_err == 0) {
            g_dbg_ft_err    = (int32_t)r;
            g_dbg_ft_failat = i + 1u;
        }
        /* 模擬使用者用手點的節奏，不要背對背灌。 */
        nap(300);
    }

    show_message("最愛自動測試", "播放中");
    g_fav_mode = true;
    build_order();
    g_dbg_ft_order = g_order_count;

    for (uint32_t i = 0; i < g_order_count && !g_card_sick; i++) {
        watchdog_feed();
        if (photo_show(PLAYLIST_BASE + g_order[i] * PATH_MAX) == PHOTO_OK) {
            present();
            g_dbg_ft_shown++;
            note_decode(true);
        } else {
            g_dbg_ft_showfail++;
            note_decode(false);
        }
    }
    g_fav_mode = false;

    g_dbg_ft_wr   = g_sd_writes - w0;
    g_dbg_ft_done = 1u;
}

void album_run(void)
{
    TS_Init_t ts = { .Width = PHYS_W, .Height = PHYS_H,
                     .Orientation = TS_SWAP_NONE, .Accuracy = 2 };
    bool wdt_reset;

    g_stage = 1;

    /* 睡眠時保持除錯連線。
     *
     * nap() 用 __WFI() 讓核心睡到下一次中斷，省電效果好，但代價是核心一睡
     * 除錯介面的時脈就被關掉 —— SWD 會直接失聯，報
     * "Unable to read device id from ROM table"，連讀個變數都做不到。
     * （還救得回來：mode=UR 是連線時按住重置，核心來不及睡。）
     *
     * 這一位元讓睡眠時的除錯時脈保持開啟。代價是省電效果打折，但這台是
     * 開發板、隨時要用 SWD 讀狀態，值得。真的要壓到最低耗電時再拿掉。 */
    HAL_DBGMCU_EnableDBGSleepMode();

    /* 開啟週期計數器，rnd_mix() 拿它當高解析度的熵來源。 */
    CoreDebug->DEMCR |= CoreDebug_DEMCR_TRCENA_Msk;
    DWT->CYCCNT = 0;

    /* 量 CN18 的 VBUS，用來判斷 USB 線插到電腦了沒（見 vbus.c）。
     * 失敗不影響相簿：vbus_mv() 之後一律回 0，就是「永遠沒插線」。 */
    vbus_init();
    DWT->CTRL |= DWT_CTRL_CYCCNTENA_Msk;

    /* 上一輪是被看門狗打掉的嗎？旗標要在這裡讀，之後會被清掉。 */
    wdt_reset = (__HAL_RCC_GET_FLAG(RCC_FLAG_IWDGRST) != 0u);
    __HAL_RCC_CLEAR_RESET_FLAGS();

    psram_mpu_init();
    screen_init();

    if (BSP_TS_Init(0, &ts) != BSP_ERROR_NONE) {
        show_message("觸控初始化失敗", 0);
    }
    button_init();
    photo_set_abort_check(ctrl_waiting);

    /* 初始化過程中設定腳位會產生假的邊緣事件，清掉再開始。 */
    g_req_pause = 0u;
    g_pressing  = 0u;

    g_bright_idx = 0u;
    brightness_set(BRIGHT_STEP[0]);   /* 100%，並給 LPTIM 明確初值 */

    g_stage = 2;
    if (!photo_init()) {
        show_message("JPEG 解碼器初始化失敗", 0);
        for (;;) { }
    }

    /* 插卡偵測腳要自己先設定好。
     *
     * BSP_SD_IsDetected() 只是讀 GPIO，不會設定它 —— 真正設定的是
     * BSP_SD_Init()。但主迴圈在掛載之前就會用 sd_present() 判斷有沒有卡，
     * 那時這支腳還沒被初始化過，讀到的是未定義狀態。實測沒插卡卻被判成
     * 有卡，於是走進掛載流程，最後顯示「記憶卡無法讀取，請確認格式為
     * FAT32」—— 訊息完全誤導。 */
    SD_DETECT_GPIO_CLK_ENABLE();
    {
        GPIO_InitTypeDef det = {0};
        det.Pin   = SD_DETECT_PIN;
        det.Mode  = GPIO_MODE_INPUT;
        det.Pull  = GPIO_NOPULL;
        det.Speed = GPIO_SPEED_FREQ_HIGH;
        HAL_GPIO_Init(SD_DETECT_GPIO_PORT, &det);
        HAL_Delay(10);              /* 讓腳位穩定再開始判斷 */
    }

    g_stage = 30;
    if (FATFS_LinkDriver(&SD_BSP_Driver, g_drive) != 0) {
        show_message("磁碟介面初始化失敗", 0);
        for (;;) { }
    }

    /* 被看門狗打掉，代表上一輪卡在記憶卡裡出不來。
     *
     * 原本是「停住並要求使用者拔卡」，因為以為只有真正斷電才清得掉。
     * 但 BSP_SD_DeInit() 就會把 SDMMC 斷電、偵測腳 DeInit 掉，效果一樣 ——
     * 而且不必人在旁邊。相框放在桌上自己卡死、要人來拔卡才會動，
     * 是最糟的失敗模式。
     *
     * 先自己試一次；真的救不回來，下面的 mount_and_scan() 會失敗並顯示
     * 「記憶卡無法讀取」，那是個安靜等待的狀態，不會一直重置。 */
    if (wdt_reset) {
        show_message("記憶卡沒有回應", "重新初始化中");
        (void)BSP_SD_DeInit(0);
        HAL_Delay(1000);
    }

    watchdog_start();

    /* 磁碟層等卡片的迴圈最長會佔住好幾秒（寫入逾時是 2 秒、還會重試），
     * 而看門狗只有 16 秒。第一版沒接這條，卡片一拒絕寫入就被重開，
     * 開機看到 IWDGRST 又停在「請拔出記憶卡再重新插入」—— 使用者看到的
     * 是「加入最愛失敗，然後連播放跟返回都不行」。 */
    sd_bsp_set_keepalive(watchdog_feed);

    g_stage = 3;
    show_message("讀取記憶卡", "載入中");

