chunyen627-afk/stm32h7s78-project/projects/album/app_src/album_main.c
    for (;;) {
        watchdog_feed();

        if (!sd_present()) {
            wait_for_card();
            continue;
        }
        if (!mount_and_scan()) {
            /* 掛不起來或沒照片：等使用者換一張卡再試。
             *
             * 但除錯旗標在這裡也要看得到 —— 拿一張沒有照片的卡來做寫入
             * 測試是很正常的事（比對不同卡片時就是這樣），只在正常路徑上
             * 檢查的話那些卡永遠測不到。 */
            while (sd_present()) {
                watchdog_feed();
                if (g_dbg_wrtest) {
                    uint32_t n = g_dbg_wrtest;

                    g_dbg_wrtest = 0;
                    show_message("寫入壓力測試", "進行中");
                    fav_stress(n);
                    continue;
                }
                if (g_dbg_cardreinit) {
                    g_dbg_cardreinit = 0;
                    break;              /* 跳出去重新掛載 */
                }
                HAL_Delay(200);
            }
            continue;
        }

#if DEBUG_ONE_SHOT
        /* 除錯：連續解好幾張（重現播放時的雙緩衝交替），最後停在一張上不動，
         * 方便用 SWD 把畫面完整抓下來。只解一張重現不了跨照片的問題。 */
        g_stage = 9;
        build_order();
        for (uint32_t k = 0; k < 6u && k < g_order_count; k++) {
            watchdog_feed();
            if (photo_show(PLAYLIST_BASE + g_order[k] * PATH_MAX) == PHOTO_OK) {
                note_decode(true);
                present();
            } else {
                note_decode(false);
            }
            HAL_Delay(300);
        }
        g_stage = 10;
        for (;;) {
            watchdog_feed();
            BSP_LED_Toggle(LD1);
            HAL_Delay(500);
        }
#else
        g_stage = 5;
        {
            bool first = true;

            while (sd_present() && !g_card_sick) {
                /* SWD 寫 g_dbg_favtest = N 就跑一輪最愛的自動測試。
                 * 選單迴圈看到旗標會先退出來，所以隨時觸發得到。 */
                if (g_dbg_favtest) {
                    uint32_t n = g_dbg_favtest;

                    g_dbg_favtest = 0;      /* 吃掉旗標，不會自己重跑 */
                    fav_selftest(n);
                    first = false;
                    continue;
                }
                /* 改完 g_dbg_sdclkdiv 之後用這個讓新時脈生效，不必重燒。 */
                if (g_dbg_cardreinit) {
                    g_dbg_cardreinit = 0;
                    g_card_sick = true;     /* 讓下面的 card_recover 收尾 */
                    break;
                }
                /* 純寫入壓力測試：只量卡片，完全不碰最愛的邏輯。 */
                if (g_dbg_wrtest) {
                    uint32_t n = g_dbg_wrtest;

                    g_dbg_wrtest = 0;
                    show_message("寫入壓力測試", "進行中");
                    fav_stress(n);
                    first = false;
                    continue;
                }
                /* 自動開播：掃描完直接播，不必手動勾資料夾按開始。
                 *
                 * 資料夾本來就預設全選（見掃描那段），所以自動開播等於
                 * 「什麼都不做就會動」。從播放往下滑回到選單之後，
                 * 後續就走正常的手動流程 —— 想改設定隨時進得去。 */
                if (AUTO_PLAY && first && selected_photo_count() > 0u) {
                    first = false;
                    build_order();
                    slideshow();
                    continue;
                }
                first = false;
                /* 除錯用：SWD 寫 g_dbg_autovideo 非 0 就直接播第一部影片。
                 * 影片問題只能靠點螢幕重現，這個旗標讓遠端也追得動。
                 * 不寫就完全等於不存在（board-notes 16.3 的旗標觸發原則）。 */
                if (g_dbg_autovideo && g_vid_count > 0u) {
                    play_video(&g_vids[0]);
                    continue;
                }
                if (select_screen()) {
                    slideshow();
                }
            }
            if (g_card_sick) {
                card_recover();
            }
        }
#endif
        /* 跳出來代表卡片被拔掉了，或是它不再回應（card_recover 已處理）。 */
    }
}
